app/controllers/pokemons_controller.rb

DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 7]]
---
  def destroy
    @pokemon = Pokemon.find(params[:id])
    @pokemon.destroy